Repository: gSpotx2f/ruantiblock_openwrt
Catalog: luci-app-ruantiblock/po/*/ruantiblock.po
Languages: ru

source: <code>!pattern</code> - entries that do not match the pattern.
ru: <code>!шаблон</code> - записи не совпадающие с шаблоном.

source: 2nd level domains that are excluded from optimization
ru: Домены 2-го уровня не подлежащие оптимизации

source: Add user entries to the blacklist when updating
ru: Добавлять записи пользователя в блэклист при обновлении

source: All
ru: Все

source: All entries
ru: Все записи

source: All entries except matching patterns
ru: Все записи, кроме соответствующих шаблонам

source: All hosts except listed
ru: Все хосты, кроме перечисленных

source: All traffic of the specified hosts passes through the proxy, without a blacklist
ru: Весь трафик указанных хостов проходит через прокси, без применения блэклиста

source: Allows you to limit the hosts that are allowed to bypass blocking
ru: Позволяет ограничить хосты, которым разрешено обходить блокировки

source: An error occurred while trying to get the log size!
ru: Произошла ошибка при попытке получить размер лога!

source: Apply
ru: Применить

source: Apply pattern as regular expression
ru: Применять фильтр как регулярное выражение

source: Apply proxy rules to router application traffic
ru: Применять правила прокси к трафику приложений роутера

source: Auto refresh
ru: Автообновление

source: Blacklist module
ru: Модуль блэклиста

source: Blacklist sources
ru: Источники блэклиста

source: Blacklist update mode
ru: Режим обновления блэклиста

source: Blacklist updates
ru: Обновления блэклиста

source: Bytes
ru: Байты

source: Cancel
ru: Отмена

source: Change dnsmasq config directory
ru: Изменить директорию конфигов dnsmasq

source: Changes have been saved.
ru: Изменения сохранены.

source: Clean up nftsets before updating blacklist
ru: Очищать nft-сеты перед обновлением блэклиста

source: Close
ru: Закрыть

source: Command failed
ru: Команда не выполнена

source: Complete service shutdown, as well as deleting nftsets and blacklist data
ru: Полное выключение службы, а также удаление nft-сетов и данных блэклиста

source: Contents have been saved.
ru: Содержимое сохранено.

source: Convert cyrillic domains to punycode
ru: Конвертировать кириллические домены в punycode

source: Current schedule
ru: Текущее расписание

source: DNS server that is used for the user's FQDN entries
ru: DNS сервер для FQDN записей пользователя

source: DNS server that is used for the FQDN entries of exclusion list
ru: DNS сервер для FQDN записей списка исключений

source: Day
ru: День

source: Description
ru: Описание

source: Disabled
ru: Отключено

source: Dismiss
ru: Закрыть

source: Dnsmasq config directory
ru: Директория конфигов dnsmasq

source: Download error
ru: Ошибка загрузки

source: Download log
ru: Скачать журнал

source: Downloading a blacklist via proxy
ru: Скачивать блэклист через прокси

source: Downloading files via proxy
ru: Скачивать файлы через прокси

source: Edit
ru: Изменить

source: Edit entries
ru: Изменить записи

source: Enable
ru: Включить

source: Enable FQDN filter
ru: Включить FQDN фильтр

source: Enable IP filter
ru: Включить IP фильтр

source: Enable exclusion list
ru: Включить список исключений

source: Enable full proxy mode
ru: Включить режим полного прокси

source: Enable user entries
ru: Включить записи пользователя

source: Enabled
ru: Включено

source: Entries
ru: Записи

source: Error
ru: Ошибка

source: Exclusion list
ru: Список исключений

source: Expecting:
ru: Ожидается:

source: FQDN filter
ru: Фильтр FQDN

source: FQDN filter type
ru: Тип FQDN фильтра

source: Facility
ru: Категория

source: Facilities
ru: Категории

source: Failed to get %s init status: %s
ru: Не удалось получить статус инициализации %s: %s

source: Filter settings
ru: Настройки фильтра

source: General settings
ru: Общие настройки

source: Get all entries
ru: Все записи

source: Get more entries
ru: Больше записей

source: HTML/XML error
ru: Ошибка HTML/XML

source: Host
ru: Хост

source: Host filter
ru: Фильтр хостов

source: Hour
ru: Час

source: If less than the specified number of entries are received from the source, then the lists are not updated
ru: Если от источника получено меньше указанного количества записей, то списки не обновляются

source: If not specified, the VPN interface address is used (or peer address for PPP protocols)
ru: Если не задан, используется адрес VPN интерфейса (или адрес пира для протоколов PPP)

source: IP address
ru: IP-адрес

source: IP addresses for full proxy mode
ru: IP-адреса для режима полного прокси

source: IP addresses for host filter
ru: IP-адреса для фильтра хостов

source: IP filter
ru: Фильтр IP

source: IP filter type
ru: Тип IP фильтра

source: IP limit
ru: Лимит IP адресов

source: IP restriction mode
ru: Режим ограничения IP адресов

source: IP subnet patterns (/24) that are excluded from optimization
ru: Шаблоны IP подсетей (/24) не подлежащих оптимизации

source: Instance
ru: Экземпляр

source: Interval
ru: Интервал

source: Invalid regular expression
ru: Неправильное регулярное выражение

source: Last blacklist update
ru: Последнее обновление блэклиста

source: Last entries
ru: Последние записи

source: Level
ru: Уровень

source: List of hosts that are excluded from block bypass (always available directly)
ru: Список хостов, которые исключаются из обхода блокировок (всегда доступны напрямую)

source: Loading
ru: Загрузка

source: Log
ru: Лог

source: Logging events
ru: Записывать события в лог

source: Logging levels
ru: Уровни логирования

source: Logread not found
ru: Logread не найден

source: Main blacklist
ru: Основной блэклист

source: Main settings
ru: Основные настройки

source: Match-set
ru: Сет

source: Message
ru: Сообщение

source: Message filter
ru: Фильтр сообщений

source: Minimum allowed number of entries
ru: Минимально возможное количество записей

source: Minute
ru: Минута

source: Module settings
ru: Настройки модуля

source: More entries
ru: Больше записей

source: Name
ru: Имя

source: Nftables rules
ru: Правила Nftables

source: No Sсhedule
ru: Нет расписания

source: No changes to save.
ru: Нет изменений для сохранения.

source: No data
ru: Нет данных

source: No entries available...
ru: Нет доступных записей...

source: Number of entries
ru: Кол-во записей

source: One entry (IP, CIDR or FQDN) per line. In the FQDN records, you can specify the DNS server for resolving this domain (separated by a space). You can also comment on lines (<code>#</code> is the first character of a line).<br />Examples:
ru: Одна запись (IP, CIDR или FQDN) на строку. В записях FQDN можно задать DNS-сервер для разрешения данного домена (через пробел). Также, можно комментировать строки (<code>#</code> - первый символ строки).<br />Примеры:

source: One FQDN entry per line. You can also comment on lines (<code>#</code> is the first character of a line).<br />Examples:
ru: Одна запись FQDN на строку. Также, можно комментировать строки (<code>#</code> - первый символ строки).<br />Примеры:

source: One IP subnet pattern (/24) per line. You can also comment on lines (<code>#</code> is the first character of a line).<br />Examples:
ru: Один шаблон IP подсети (/24) на строку Также, можно комментировать строки (<code>#</code> - первый символ строки).<br />Примеры:

source: One of the following:
ru: Одно из следующих значений:

source: Only entries matching patterns
ru: Только записи, соответствующие шаблонам

source: Only listed hosts
ru: Только перечисленные хосты

source: Optional DNS resolver
ru: Альтернативный DNS резолвер

source: Optional DNS resolver for '.onion' zone
ru: Дополнительный DNS резолвер для зоны '.onion'

source: Patterns can be strings or regular expressions. Each pattern in a separate line, the symbol <code>#</code> in the first position of the line - comments on the line.<br />Examples (dot is a special character):
ru: Шаблоны могут быть строками или регулярными выражениями. Каждый шаблон в отдельной строке, символ <code>#</code> в первой позиции строки - комментирует строку.<br />Примеры (точка - спецсимвол):

source: Patterns can be strings or regular expressions. Each pattern in a separate line, the symbol <code>#</code> in the first position of the line - comments on the line.<br />Examples:
ru: Шаблоны могут быть строками или регулярными выражениями. Каждый шаблон в отдельной строке, символ <code>#</code> в первой позиции строки - комментирует строку.<br />Примеры:

source: Pick IP addresses from blacklist by IP filter patterns
ru: Отбор IP адресов из блэклиста по шаблонам фильтра IP

source: Pick domains from blacklist by FQDN filter patterns
ru: Отбор доменов из блэклиста по шаблонам фильтра FQDN

source: Protocol
ru: Протокол

source: Proxy mode
ru: Режим прокси

source: Proxy type
ru: Тип прокси

source: Reduces RAM consumption during update
ru: Уменьшает потребление оперативной памяти при обновлении

source: Refresh log
ru: Обновить лог

source: Reset
ru: Сбросить

source: Restriction the local network hosts that are allowed to bypass blocking
ru: Ограничение хостов локальной сети, которым разрешено обходить блокировки

source: Run at startup
ru: Запуск при старте системы

source: Safe blacklist update
ru: Безопасное обновление блэклиста

source: Save
ru: Сохранить

source: Send UDP traffic to transparent proxy
ru: Отправлять в прозрачный прокси UDP-трафик

source: Service
ru: Служба

source: Service action failed "%s %s": %s
ru: Не удалось выполнить действие службы "%s %s": %s

source: Set
ru: Установить

source: Settings
ru: Настройки

source: Shutdown
ru: Выключение

source: Skip marked packets
ru: Пропускать помеченные пакеты

source: Skip packets that have already been marked in previous rules
ru: Пропускать пакеты, которые уже были помечены в предыдущих правилах

source: Sorting entries
ru: Сортировка записей

source: Starting
ru: Запускается

source: Statistics
ru: Статистика

source: Statement in nftables rules
ru: Действие в правилах nftables

source: Status
ru: Статус

source: Subdomains limit
ru: Лимит субдоменов

source: Summarize '/24' networks
ru: Суммировать '/24' подсети

source: Summarize IP ranges
ru: Суммировать IP диапазоны

source: If update fails, the old blacklist configuration will be retained. Temporary files are used, when updating the blacklist (increases memory consumption).
ru: Если обновление завершилось с ошибками, будет сохранена старая конфигурация блэклиста. При обновлении используются временные файлы (увеличивается потребление памяти).

source: The number of IP addresses in the subnet, upon reaching which the entire '/24' subnet is added to the list
ru: Количество IP адресов подсети, при достижении которого в список добавляется вся '/24' подсеть

source: The number of subdomains in the domain, upon reaching which the entire 2nd level domain is added to the list
ru: Количество субдоменов, при достижении которого в список добавляется весь домен 2-го уровня

source: The service will be disabled and all blacklist data will be deleted. Continue?
ru: Служба будет выключена и все данные блэклиста будут удалены. Продолжить?

source: Time
ru: Время

source: Timeout
ru: Таймаут

source: Timestamp
ru: Время

source: Timestamp filter
ru: Фильтр даты

source: Tor configuration file
ru: Конфигурационный файл Tor

source: Tor mode
ru: Режим Tor

source: Transparent proxy
ru: Прозрачный прокси

source: Transparent proxy mode
ru: Режим прозрачного прокси

source: Transparent proxy port
ru: Порт прозрачного прокси

source: Transparent proxy TCP port
ru: TCP порт прозрачного прокси

source: Transparent proxy UDP port
ru: UDP порт прозрачного прокси

source: Turn on if blacklist source is blocked
ru: Включите, если источник блэклиста заблокирован

source: Turn on if files are blocked
ru: Включите, если файлы заблокированы

source: Type a search pattern...
ru: Введите шаблон для поиска

source: Type of adding a VPN rule to the routing table
ru: Тип добавления правила VPN в таблицу маршрутизации

source: Unable to execute or read contents
ru: Невозможно выполнить или прочитать содержимое

source: Unable to load log data:
ru: Невозможно загрузить данные лога:

source: Unable to read the contents
ru: Невозможно прочитать содержимое

source: Unable to save the changes
ru: Невозможно сохранить изменения

source: Unable to save the contents
ru: Невозможно сохранить содержимое

source: Unsupported log format
ru: Неподдерживаемый формат лога

source: Update
ru: Обновить

source: Update at startup
ru: Обновление при запуске

source: Update blacklist
ru: Обновить блэклист

source: Update blacklist after system startup
ru: Обновлять блэклист после запуска системы

source: Updating
ru: Обновление

source: URLs of remote user entries file
ru: URL удалённых файлов записей пользователя

source: Use optional DNS resolver
ru: Использовать альтернативный DNS резолвер

source: User entries
ru: Записи пользователя

source: VPN gateway IP address
ru: IP адрес шлюза VPN

source: VPN interface
ru: VPN интерфейс

source: VPN mode
ru: Режим VPN

source: VPN routing error! Need restart
ru: Ошибка маршрутизации VPN! Необходим перезапуск

source: all
ru: все

source: ascending
ru: по возрастанию

source: default
ru: по умолчанию

source: descending
ru: по убыванию

source: disabled
ru: отключен

source: e.g:
ru: прим:

source: hotplug.d - default option for many VPN applications that supported by OpenWrt.
ru: hotplug.d - стандартная опция для многих VPN-приложений поддерживаемых в OpenWrt.

source: net pattern
ru: шаблон сети

source: none (user entries only)
ru: нет (только записи пользователя)

source: requires installed blacklist module
ru: необходим установленный модуль блэклиста

source: user entries only
ru: только записи пользователя

source: ruab_route_check - script that regularly checks an entry in the routing table.
ru: ruab_route_check - скрипт, который регулярно проверяет запись в таблице маршрутизации.

source: valid IP address
ru: верный IP-адрес

source: valid address#port
ru: верный IP-адрес#порт

source: valid URL
ru: верный URL
